doc/s-sql-i.org
#+TITLE: S-SQL Examples I
#+OPTIONS: num:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
#+HTML_HEAD: <style>pre.src{background:#343131;color:white;} </style>
#+OPTIONS: ^:nil

* [[file:s-sql-examples.org][S-SQL Examples Home Page]]
| [[file:s-sql-a.org][A]]| [[file:s-sql-b.org][B]]| [[file:s-sql-c.org][C]]| [[file:s-sql-d.org][D]]| [[file:s-sql-e.org][E]]| [[file:s-sql-f.org][F]]| [[file:s-sql-g.org][G]]| [[file:s-sql-h.org][H]]| [[file:s-sql-i.org][I]]| [[file:s-sql-j.org][J]]| [[file:s-sql-k.org][K]]| [[file:s-sql-l.org][L]]| [[file:s-sql-m.org][M]]| [[file:s-sql-n.org][N]]| [[file:s-sql-o.org][O]]| [[file:s-sql-p.org][P]]| [[file:s-sql-r.org][R]]| [[file:s-sql-s.org][S]]| [[file:s-sql-t.org][T]]| [[file:s-sql-u.org][U]]| [[file:s-sql-v.org][V]]| [[file:s-sql-w.org][W]]|  [[file:s-sql-special-characters.org][Special Characters]]                        |  [[file:calling-postgresql-stored-functions.org][Calling Postgresql Stored Functions and Procedures]]|

* ilike
  :PROPERTIES:
  :CUSTOM_ID: iloke
  :END:
See [[file:s-sql-l.org][s-sql-l (like, ilike, limit)]]

* In
  :PROPERTIES:
  :CUSTOM_ID: in
  :END:
#+begin_src lisp
  (query (:select 'name
                :from 'countries
                :where (:in 'id
                            (:set 20 21 23))))
#+end_src

* Insert, Insert-into
  :PROPERTIES:
  :CUSTOM_ID: insert
  :END:
** First, without s-sql
  :PROPERTIES:
  :CUSTOM_ID: sql-insert
  :END:
#+begin_src lisp
  (query "insert into 'countries values (920, 'Oz', 'Oz Dollars')")
#+end_src

** With s-sql
  :PROPERTIES:
  :CUSTOM_ID: s-sql-insert
  :END:
There are two ways to use s-sql with basic single row inserts. First, directly setting the columns, using the :set keyword and alternating column names and values. This means that the :insert-into clause expects the arguments to :set to be in multiples of two. Odd arguments will trigger an error.
#+begin_src lisp
  (query (:insert-into 'countries :set 'id 920 'name "Oz"
                                     'currency "Oz Dollars"))
#+end_src
Notice that a list with two items is a single item, not a multiple of two. You can use sql-compile to deal with this. See this example from the mailing list.
#+begin_src lisp
  (sql-compile `(:insert-into 'kupci :set ,@(when t (list 'ime "a"))))
#+end_src
The second method, without the :set keyword, uses :select, followed by values.
#+begin_src lisp
  (query (:insert-into 'countries (:select "Oz" "Oz Dollars")))

  (query (:insert-into 'test2 (:select '* :from 'test1)))
#+end_src

** Returning the Primary Key
  :PROPERTIES:
  :CUSTOM_ID: returning-primary
  :END:
Suppose your table has a serial key of id and you want the insert function to return the newly generated id for that new record.
#+begin_src lisp
  (query (:insert-into 'categories :set 'name "test-cat3" :returning 'id)
       :single)
#+end_src
The next example shows the same example using parameterized variables.
#+begin_src lisp
  (let ((name "test-cat4"))
    (query (:insert-into 'categories :set 'name '$1 :returning 'id)
           name :single))
#+end_src
Note: This is a postgresql extension to the standard From the Documentation:

INSERT conforms to the SQL standard, except that the RETURNING clause is a PostgreSQL extension, as is the ability to use WITH with INSERT, and the ability to specify an alternative action with ON CONFLICT. Also, the case in which a column name list is omitted, but not all the columns are filled from the VALUES clause or query, is disallowed by the standard.

The SQL standard specifies that OVERRIDING SYSTEM VALUE can only be specified if an identity column that is generated always exists. PostgreSQL allows the clause in any case and ignores it if it is not applicable.
With DAOs
** Insert-DAO
Postmodern has an update-dao and an insert-dao function. You could check and see if the dao that you are currently dealing with has its primary key set (in which case you are editing an existing object and need to use update-dao. If not, then you dealing with a brand new object and will need to set the primary key and use the insert-dao method, using something like this:
#+begin_src lisp
  (if (id item) (postmodern:update-dao item)
      (progn (setf (id item) (get-next-id class-name))
         (postmodern:insert-dao item)))
#+end_src
However, you could also just use upsert.
#+begin_src lisp
  (postmodern:upsert-dao item)
#+end_src

