doc/s-sql-i.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-12-12 Tue 18:54 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>S-SQL Examples I</title>
<meta name="author" content="Sabra Crolleton" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<header>
<h1 class="title">S-SQL Examples I</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org17213a8">S-SQL Examples Home Page</a></li>
<li><a href="#iloke">ilike</a></li>
<li><a href="#in">In</a></li>
<li><a href="#insert">Insert, Insert-into</a>
<ul>
<li><a href="#sql-insert">First, without s-sql</a></li>
<li><a href="#s-sql-insert">With s-sql</a></li>
<li><a href="#returning-primary">Returning the Primary Key</a></li>
<li><a href="#org648e288">Insert-DAO</a></li>
<li><a href="#multiple-row-inserts">Multiple Row Inserts</a></li>
<li><a href="#Insert-Rows-On-Conflict-Do-Nothing">Insert-Rows-On-Conflict-Do-Nothing</a></li>
<li><a href="#Insert-Rows-On-Conflict-update">Insert-Rows-On-Conflict-Update</a></li>
<li><a href="#insert-from-alist">Inserting from an alist</a></li>
<li><a href="#insert-from-plist">Inserting from a plist</a></li>
</ul>
</li>
<li><a href="#intersect">Intersect</a></li>
<li><a href="#intervals">Intervals</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org17213a8" class="outline-2">
<h2 id="org17213a8"><a href="s-sql-examples.html">S-SQL Examples Home Page</a></h2>
<div class="outline-text-2" id="text-org17213a8">
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="s-sql-a.html">A</a></td>
<td class="org-left"><a href="s-sql-b.html">B</a></td>
<td class="org-left"><a href="s-sql-c.html">C</a></td>
<td class="org-left"><a href="s-sql-d.html">D</a></td>
<td class="org-left"><a href="s-sql-e.html">E</a></td>
<td class="org-left"><a href="s-sql-f.html">F</a></td>
<td class="org-left"><a href="s-sql-g.html">G</a></td>
<td class="org-left"><a href="s-sql-h.html">H</a></td>
<td class="org-left"><a href="s-sql-i.html">I</a></td>
<td class="org-left"><a href="s-sql-j.html">J</a></td>
<td class="org-left"><a href="s-sql-k.html">K</a></td>
<td class="org-left"><a href="s-sql-l.html">L</a></td>
<td class="org-left"><a href="s-sql-m.html">M</a></td>
<td class="org-left"><a href="s-sql-n.html">N</a></td>
<td class="org-left"><a href="s-sql-o.html">O</a></td>
<td class="org-left"><a href="s-sql-p.html">P</a></td>
<td class="org-left"><a href="s-sql-r.html">R</a></td>
<td class="org-left"><a href="s-sql-s.html">S</a></td>
<td class="org-left"><a href="s-sql-t.html">T</a></td>
<td class="org-left"><a href="s-sql-u.html">U</a></td>
<td class="org-left"><a href="s-sql-v.html">V</a></td>
<td class="org-left"><a href="s-sql-w.html">W</a></td>
<td class="org-left"><a href="s-sql-special-characters.html">Special Characters</a></td>
<td class="org-left"><a href="calling-postgresql-stored-functions.html">Calling Postgresql Stored Functions and Procedures</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-iloke" class="outline-2">
<h2 id="iloke">ilike</h2>
<div class="outline-text-2" id="text-iloke">
<p>
See <a href="s-sql-l.html">s-sql-l (like, ilike, limit)</a>
</p>
</div>
</div>

<div id="outline-container-in" class="outline-2">
<h2 id="in">In</h2>
<div class="outline-text-2" id="text-in">
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:select</span> 'name
              <span class="org-builtin">:from</span> 'countries
              <span class="org-builtin">:where</span> (<span class="org-builtin">:in</span> 'id
                          (<span class="org-builtin">:set</span> 20 21 23))))
</pre>
</div>
</div>
</div>

<div id="outline-container-insert" class="outline-2">
<h2 id="insert">Insert, Insert-into</h2>
<div class="outline-text-2" id="text-insert">
</div>
<div id="outline-container-sql-insert" class="outline-3">
<h3 id="sql-insert">First, without s-sql</h3>
<div class="outline-text-3" id="text-sql-insert">
<div class="org-src-container">
<pre class="src src-lisp">(query <span class="org-string">"insert into 'countries values (920, 'Oz', 'Oz Dollars')"</span>)
</pre>
</div>
</div>
</div>

<div id="outline-container-s-sql-insert" class="outline-3">
<h3 id="s-sql-insert">With s-sql</h3>
<div class="outline-text-3" id="text-s-sql-insert">
<p>
There are two ways to use s-sql with basic single row inserts. First, directly setting the columns, using the :set keyword and alternating column names and values. This means that the :insert-into clause expects the arguments to :set to be in multiples of two. Odd arguments will trigger an error.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-into</span> 'countries <span class="org-builtin">:set</span> 'id 920 'name <span class="org-string">"Oz"</span>
                                   'currency <span class="org-string">"Oz Dollars"</span>))
</pre>
</div>
<p>
Notice that a list with two items is a single item, not a multiple of two. You can use sql-compile to deal with this. See this example from the mailing list.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql-compile `(<span class="org-builtin">:insert-into</span> 'kupci <span class="org-builtin">:set</span> ,@(<span class="org-keyword">when</span> t (list 'ime <span class="org-string">"a"</span>))))
</pre>
</div>
<p>
The second method, without the :set keyword, uses :select, followed by values.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-into</span> 'countries (<span class="org-builtin">:select</span> <span class="org-string">"Oz"</span> <span class="org-string">"Oz Dollars"</span>)))

(query (<span class="org-builtin">:insert-into</span> 'test2 (<span class="org-builtin">:select</span> '* <span class="org-builtin">:from</span> 'test1)))
</pre>
</div>
</div>
</div>

<div id="outline-container-returning-primary" class="outline-3">
<h3 id="returning-primary">Returning the Primary Key</h3>
<div class="outline-text-3" id="text-returning-primary">
<p>
Suppose your table has a serial key of id and you want the insert function to return the newly generated id for that new record.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-into</span> 'categories <span class="org-builtin">:set</span> 'name <span class="org-string">"test-cat3"</span> <span class="org-builtin">:returning</span> 'id)
     <span class="org-builtin">:single</span>)
</pre>
</div>
<p>
The next example shows the same example using parameterized variables.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((name <span class="org-string">"test-cat4"</span>))
  (query (<span class="org-builtin">:insert-into</span> 'categories <span class="org-builtin">:set</span> 'name '$1 <span class="org-builtin">:returning</span> 'id)
         name <span class="org-builtin">:single</span>))
</pre>
</div>
<p>
Note: This is a postgresql extension to the standard From the Documentation:
</p>

<p>
INSERT conforms to the SQL standard, except that the RETURNING clause is a PostgreSQL extension, as is the ability to use WITH with INSERT, and the ability to specify an alternative action with ON CONFLICT. Also, the case in which a column name list is omitted, but not all the columns are filled from the VALUES clause or query, is disallowed by the standard.
</p>

<p>
The SQL standard specifies that OVERRIDING SYSTEM VALUE can only be specified if an identity column that is generated always exists. PostgreSQL allows the clause in any case and ignores it if it is not applicable.
With DAOs
</p>
</div>
</div>
<div id="outline-container-org648e288" class="outline-3">
<h3 id="org648e288">Insert-DAO</h3>
<div class="outline-text-3" id="text-org648e288">
<p>
Postmodern has an update-dao and an insert-dao function. You could check and see if the dao that you are currently dealing with has its primary key set (in which case you are editing an existing object and need to use update-dao. If not, then you dealing with a brand new object and will need to set the primary key and use the insert-dao method, using something like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">if</span> (id item) (postmodern:update-dao item)
    (<span class="org-keyword">progn</span> (setf (id item) (get-next-id class-name))
       (postmodern:insert-dao item)))
</pre>
</div>
<p>
However, you could also just use upsert.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(postmodern:upsert-dao item)
</pre>
</div>
</div>
</div>
