doc/s-sql-i.org
** Multiple Row Inserts
  :PROPERTIES:
  :CUSTOM_ID: multiple-row-inserts
  :END:
You can use s-sql to generate INSERT INTO clauses with multiple rows, e.g. "INSERT INTO \"table\" (a, b) VALUES (10, 20), (30, 40)". (This ability does not yet exist with respect to inserting multiple daos.

First, without specifying columns:
#+begin_src lisp
  (query (:insert-rows-into 'my-table :values '((42 "foobar") (23 "foobaz"))))
#+end_src
Now with specifying columns:
#+begin_src lisp
  (query (:insert-rows-into 'table
                   :columns 'a 'b
                   :values '((10 20) (30 40))))

  (query (:insert-rows-into 'cd.facilities
                   :columns 'facid 'name 'membercost 'guestcost 'initialoutlay 'monthlymaintenance
                   :values '((9 "Spa" 20 30 100000 800)
                             (10 "Squash Court 2" 3.5 17.5 5000 80))))
#+end_src
Using a select statement:
#+begin_src lisp
  (query (:insert-rows-into 'cd.facilities
                   :columns 'facid 'name 'membercost 'guestcost 'initialoutlay 'monthlymaintenance
                   :values '(((:select (:+ (:select (:max 'facid)
                                            :from 'cd.facilities)
                                        1))
                              "Spa" 20 30 100000 800))))
#+end_src
Overriding System Values:
#+begin_src lisp
  (query (:insert-rows-into 'table1
          :columns 'c1 'c2
          :overriding-system-value
          :values '((1 "a") (2 "b"))))
#+end_src
** Insert-Rows-On-Conflict-Do-Nothing
  :PROPERTIES:
  :CUSTOM_ID: Insert-Rows-On-Conflict-Do-Nothing
  :END:
Inserting rows with on conflict do nothing
#+begin_src lisp
  (query (:insert-rows-into 'distributors
                   :columns 'did 'dname
                   :values '((7 "Readline GmbH"))
                   :on-conflict-do-nothing))
#+end_src
:on-conflict with separate :do-nothing keyword
#+begin_src lisp
  (query (:insert-rows-into 'test :columns 'some-key 'some-val
                                     :values '(("a" 5) ("b" 6) ("c" 7))
                                     :on-conflict 'some-key
                                     :do-nothing))
#+end_src
With where condition
#+begin_src lisp
  (query (:insert-rows-into 'distributors
                   :columns 'did 'dname
                   :values '((10 "Conrad International"))
                   :on-conflict 'did
                   :do-nothing
                   :where 'is-active))
#+end_src
With returning
#+begin_src lisp
  (query (:insert-rows-into 'distributors
          :columns 'did 'dname
                            :values '((8 "Readline GmbH"))
                            :on-conflict 'did 'dname
          :do-nothing
                            :returning 'id))
#+end_src
With on-conflict-on-constraint and do-nothing as a separate operator
#+begin_src lisp
  (query (:insert-rows-into 'distributors :columns 'did 'dname
                            :values '((10 "Readline GmbH"))
                            :on-conflict-on-constraint 'distributors-pkey
                            :do-nothing
          :returning 'id))
#+end_src
With on-conflict constraint with separate :do-nothing keyword and returning
#+begin_src lisp
  (sql (:insert-rows-into 'test :columns 'some-key 'some-val
                          :values '(("a" 4) ("b" 6) ("c" 7))
                          :on-conflict 'some-key
                          :do-nothing
        :returning '*))
#+end_src
multiple values basic :on-conflict-on-constraint with separate :do-nothing keyword and returning
#+begin_src lisp
  (query (:insert-rows-into 'test :columns 'some-key 'some-val
                          :values '(("a" 3) ("b" 6) ("c" 7))
                          :on-conflict-on-constraint 'somekey
                          :do-nothing
          :returning '*))
#+end_src
