doc/s-sql-i.html

<div id="outline-container-multiple-row-inserts" class="outline-3">
<h3 id="multiple-row-inserts">Multiple Row Inserts</h3>
<div class="outline-text-3" id="text-multiple-row-inserts">
<p>
You can use s-sql to generate INSERT INTO clauses with multiple rows, e.g. "INSERT INTO \"table\" (a, b) VALUES (10, 20), (30, 40)". (This ability does not yet exist with respect to inserting multiple daos.
</p>

<p>
First, without specifying columns:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'my-table <span class="org-builtin">:values</span> '((42 <span class="org-string">"foobar"</span>) (23 <span class="org-string">"foobaz"</span>))))
</pre>
</div>
<p>
Now with specifying columns:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'table
                 <span class="org-builtin">:columns</span> 'a 'b
                 <span class="org-builtin">:values</span> '((10 20) (30 40))))

(query (<span class="org-builtin">:insert-rows-into</span> 'cd.facilities
                 <span class="org-builtin">:columns</span> 'facid 'name 'membercost 'guestcost 'initialoutlay 'monthlymaintenance
                 <span class="org-builtin">:values</span> '((9 <span class="org-string">"Spa"</span> 20 30 100000 800)
                           (10 <span class="org-string">"Squash Court 2"</span> 3.5 17.5 5000 80))))
</pre>
</div>
<p>
Using a select statement:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'cd.facilities
                 <span class="org-builtin">:columns</span> 'facid 'name 'membercost 'guestcost 'initialoutlay 'monthlymaintenance
                 <span class="org-builtin">:values</span> '(((<span class="org-builtin">:select</span> (<span class="org-builtin">:+</span> (<span class="org-builtin">:select</span> (<span class="org-builtin">:max</span> 'facid)
                                          <span class="org-builtin">:from</span> 'cd.facilities)
                                      1))
                            <span class="org-string">"Spa"</span> 20 30 100000 800))))
</pre>
</div>
<p>
Overriding System Values:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'table1
        <span class="org-builtin">:columns</span> 'c1 'c2
        <span class="org-builtin">:overriding-system-value</span>
        <span class="org-builtin">:values</span> '((1 <span class="org-string">"a"</span>) (2 <span class="org-string">"b"</span>))))
</pre>
</div>
</div>
</div>
<div id="outline-container-Insert-Rows-On-Conflict-Do-Nothing" class="outline-3">
<h3 id="Insert-Rows-On-Conflict-Do-Nothing">Insert-Rows-On-Conflict-Do-Nothing</h3>
<div class="outline-text-3" id="text-Insert-Rows-On-Conflict-Do-Nothing">
<p>
Inserting rows with on conflict do nothing
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'distributors
                 <span class="org-builtin">:columns</span> 'did 'dname
                 <span class="org-builtin">:values</span> '((7 <span class="org-string">"Readline GmbH"</span>))
                 <span class="org-builtin">:on-conflict-do-nothing</span>))
</pre>
</div>
<p>
:on-conflict with separate :do-nothing keyword
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'test <span class="org-builtin">:columns</span> 'some-key 'some-val
                                   <span class="org-builtin">:values</span> '((<span class="org-string">"a"</span> 5) (<span class="org-string">"b"</span> 6) (<span class="org-string">"c"</span> 7))
                                   <span class="org-builtin">:on-conflict</span> 'some-key
                                   <span class="org-builtin">:do-nothing</span>))
</pre>
</div>
<p>
With where condition
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'distributors
                 <span class="org-builtin">:columns</span> 'did 'dname
                 <span class="org-builtin">:values</span> '((10 <span class="org-string">"Conrad International"</span>))
                 <span class="org-builtin">:on-conflict</span> 'did
                 <span class="org-builtin">:do-nothing</span>
                 <span class="org-builtin">:where</span> 'is-active))
</pre>
</div>
<p>
With returning
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'distributors
        <span class="org-builtin">:columns</span> 'did 'dname
                          <span class="org-builtin">:values</span> '((8 <span class="org-string">"Readline GmbH"</span>))
                          <span class="org-builtin">:on-conflict</span> 'did 'dname
        <span class="org-builtin">:do-nothing</span>
                          <span class="org-builtin">:returning</span> 'id))
</pre>
</div>
<p>
With on-conflict-on-constraint and do-nothing as a separate operator
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'distributors <span class="org-builtin">:columns</span> 'did 'dname
                          <span class="org-builtin">:values</span> '((10 <span class="org-string">"Readline GmbH"</span>))
                          <span class="org-builtin">:on-conflict-on-constraint</span> 'distributors-pkey
                          <span class="org-builtin">:do-nothing</span>
        <span class="org-builtin">:returning</span> 'id))
</pre>
</div>
<p>
With on-conflict constraint with separate :do-nothing keyword and returning
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql (<span class="org-builtin">:insert-rows-into</span> 'test <span class="org-builtin">:columns</span> 'some-key 'some-val
                        <span class="org-builtin">:values</span> '((<span class="org-string">"a"</span> 4) (<span class="org-string">"b"</span> 6) (<span class="org-string">"c"</span> 7))
                        <span class="org-builtin">:on-conflict</span> 'some-key
                        <span class="org-builtin">:do-nothing</span>
      <span class="org-builtin">:returning</span> '*))
</pre>
</div>
<p>
multiple values basic :on-conflict-on-constraint with separate :do-nothing keyword and returning
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'test <span class="org-builtin">:columns</span> 'some-key 'some-val
                        <span class="org-builtin">:values</span> '((<span class="org-string">"a"</span> 3) (<span class="org-string">"b"</span> 6) (<span class="org-string">"c"</span> 7))
                        <span class="org-builtin">:on-conflict-on-constraint</span> 'somekey
                        <span class="org-builtin">:do-nothing</span>
        <span class="org-builtin">:returning</span> '*))
</pre>
</div>
</div>
</div>
