doc/s-sql-i.org
** Insert-Rows-On-Conflict-Update
  :PROPERTIES:
  :CUSTOM_ID: Insert-Rows-On-Conflict-update
  :END:
basic version single row
#+begin_src lisp
  (query (:insert-rows-into 'users
          :values '(((:uuid-generate-v4) "Lucie" "Hawkins" "Lucie-Jones@gmail.com"))
          :on-conflict-update 'email
          :update-set 'first-name 'excluded.first-name 'last-name 'excluded.last-name))
#+end_src
Basic version multiple row and specified columns
#+begin_src lisp
  (query (:insert-rows-into 'distributors
          :columns 'did 'dname
                            :values '((5 "Gizmo Transglobal") (6 "Associated Computing Inc."))
                            :on-conflict-update 'did
                            :update-set 'dname 'excluded.dname))
#+end_src
With where clause
#+begin_src lisp
  (query (:insert-rows-into 'users
          :values '(((:uuid-generate-v4) "Lucie" "Hawkins" "Lucie-Jones@gmail.com"))
          :on-conflict-update 'email
          :update-set 'first-name 'excluded.first-name 'last-name 'excluded.last-name
                            :where (:<> 'u.first-name "Lucie")))
#+end_src
With an as clause at the table level
#+begin_src lisp
  (query (:insert-rows-into (:as 'users 'u)
          :values '(((:uuid-generate-v4) "Lucie" "Jones" "Lucie-Jones@gmail.com"))
          :on-conflict-update 'email
          :update-set 'first-name 'excluded.first-name 'last-name 'excluded.last-name
                            :where (:<> 'u.first-name "Lucie")))
#+end_src
With concatenation function in the update-set clause
#+begin_src lisp
  (query (:insert-rows-into (:as 'distributors 'd)
          :columns 'did 'dname
          :values '((8 "Anvil Distribution"))
          :on-conflict-update 'did
          :update-set 'dname (:|| 'excluded.dname  " (formerly " 'd.dname ")")
          :where (:<> 'd.zipcode "21201")))
#+end_src
with on-conflict-on-constraint
#+begin_src lisp
  (query (:insert-rows-into 'test
          :columns 'some-key 'some-val
          :values '(("a" 5))
          :on-conflict-on-constraint 'somekey
          :update-set 'some-val 'excluded.some-val))
#+end_src
With on-conflict-on-constraint and returning clause
#+begin_src lisp
  (query (:insert-rows-into 'test
          :columns 'some-key 'some-val
          :values '(("a" 2) ("b" 6) ("c" 7))
          :on-conflict-on-constraint 'somekey
          :update-set 'some-val 'excluded.some-val
          :returning '*))
#+end_src
With on-conflict-on-constraint with addition function in the update-set clause
#+begin_src lisp
  (queryl (:insert-rows-into 'test
                   :columns 'some-key
                   :values '(("a"))
                   :on-conflict-on-constraint 'somekey
                   :update-set 'some-val (:+ 'test.some-val 1)))
#+end_src
With select clause which returns a single row
#+begin_src lisp
  (query (:insert-rows-into 'attendence :columns 'event-id 'client-id 'attend-status
          :values '(((:select 'id
                      :from 'event
                      :where (:= (:lower 'event-dt) "2020-01-11 17:00:00"))
                     3
                     "No Show"))
          :on-conflict-on-constraint 'attendance-pkey
          :update-set 'attend-status 'excluded.attend_status))
#+end_src

** Inserting from an alist
  :PROPERTIES:
  :CUSTOM_ID: insert-from-alist
  :END:
Assume that you have a list of alists and you want to insert the data. If the list of alists contain all the columns, then you do not need to specify the columns and simply loop across to get the total lists of values:
#+begin_src lisp
  (let ((alst '(((name . "John") (age . 34)) ((name . "Susan") (age . 37)))))
    (query (:insert-rows-into 'table
            :values (loop :for x :in alst
                          :collect
                          (loop :for y :in x
                                :collect (cdr y))))))
#+end_src
If the alists only contain a subset of the columns, then you would need to specify the columns:
#+begin_src lisp
  (let ((alst '(((name . "John") (age . 34)) ((name . "Susan") (age . 37)))))
    (query (:insert-rows-into 'table
            :columns 'name 'age
            :values (loop :for x :in alst
                          :collect
                          (loop :for y :in x
                                :collect (cdr y))))))
#+end_src
