doc/s-sql-i.html
<div id="outline-container-Insert-Rows-On-Conflict-update" class="outline-3">
<h3 id="Insert-Rows-On-Conflict-update">Insert-Rows-On-Conflict-Update</h3>
<div class="outline-text-3" id="text-Insert-Rows-On-Conflict-update">
<p>
basic version single row
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'users
        <span class="org-builtin">:values</span> '(((<span class="org-builtin">:uuid-generate-v4</span>) <span class="org-string">"Lucie"</span> <span class="org-string">"Hawkins"</span> <span class="org-string">"Lucie-Jones@gmail.com"</span>))
        <span class="org-builtin">:on-conflict-update</span> 'email
        <span class="org-builtin">:update-set</span> 'first-name 'excluded.first-name 'last-name 'excluded.last-name))
</pre>
</div>
<p>
Basic version multiple row and specified columns
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'distributors
        <span class="org-builtin">:columns</span> 'did 'dname
                          <span class="org-builtin">:values</span> '((5 <span class="org-string">"Gizmo Transglobal"</span>) (6 <span class="org-string">"Associated Computing Inc."</span>))
                          <span class="org-builtin">:on-conflict-update</span> 'did
                          <span class="org-builtin">:update-set</span> 'dname 'excluded.dname))
</pre>
</div>
<p>
With where clause
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'users
        <span class="org-builtin">:values</span> '(((<span class="org-builtin">:uuid-generate-v4</span>) <span class="org-string">"Lucie"</span> <span class="org-string">"Hawkins"</span> <span class="org-string">"Lucie-Jones@gmail.com"</span>))
        <span class="org-builtin">:on-conflict-update</span> 'email
        <span class="org-builtin">:update-set</span> 'first-name 'excluded.first-name 'last-name 'excluded.last-name
                          <span class="org-builtin">:where</span> (<span class="org-builtin">:&lt;&gt;</span> 'u.first-name <span class="org-string">"Lucie"</span>)))
</pre>
</div>
<p>
With an as clause at the table level
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> (<span class="org-builtin">:as</span> 'users 'u)
        <span class="org-builtin">:values</span> '(((<span class="org-builtin">:uuid-generate-v4</span>) <span class="org-string">"Lucie"</span> <span class="org-string">"Jones"</span> <span class="org-string">"Lucie-Jones@gmail.com"</span>))
        <span class="org-builtin">:on-conflict-update</span> 'email
        <span class="org-builtin">:update-set</span> 'first-name 'excluded.first-name 'last-name 'excluded.last-name
                          <span class="org-builtin">:where</span> (<span class="org-builtin">:&lt;&gt;</span> 'u.first-name <span class="org-string">"Lucie"</span>)))
</pre>
</div>
<p>
With concatenation function in the update-set clause
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> (<span class="org-builtin">:as</span> 'distributors 'd)
        <span class="org-builtin">:columns</span> 'did 'dname
        <span class="org-builtin">:values</span> '((8 <span class="org-string">"Anvil Distribution"</span>))
        <span class="org-builtin">:on-conflict-update</span> 'did
        <span class="org-builtin">:update-set</span> 'dname (:|| 'excluded.dname  <span class="org-string">" (formerly "</span> 'd.dname <span class="org-string">")"</span>)
        <span class="org-builtin">:where</span> (<span class="org-builtin">:&lt;&gt;</span> 'd.zipcode <span class="org-string">"21201"</span>)))
</pre>
</div>
<p>
with on-conflict-on-constraint
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'test
        <span class="org-builtin">:columns</span> 'some-key 'some-val
        <span class="org-builtin">:values</span> '((<span class="org-string">"a"</span> 5))
        <span class="org-builtin">:on-conflict-on-constraint</span> 'somekey
        <span class="org-builtin">:update-set</span> 'some-val 'excluded.some-val))
</pre>
</div>
<p>
With on-conflict-on-constraint and returning clause
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'test
        <span class="org-builtin">:columns</span> 'some-key 'some-val
        <span class="org-builtin">:values</span> '((<span class="org-string">"a"</span> 2) (<span class="org-string">"b"</span> 6) (<span class="org-string">"c"</span> 7))
        <span class="org-builtin">:on-conflict-on-constraint</span> 'somekey
        <span class="org-builtin">:update-set</span> 'some-val 'excluded.some-val
        <span class="org-builtin">:returning</span> '*))
</pre>
</div>
<p>
With on-conflict-on-constraint with addition function in the update-set clause
</p>
<div class="org-src-container">
<pre class="src src-lisp">(queryl (<span class="org-builtin">:insert-rows-into</span> 'test
                 <span class="org-builtin">:columns</span> 'some-key
                 <span class="org-builtin">:values</span> '((<span class="org-string">"a"</span>))
                 <span class="org-builtin">:on-conflict-on-constraint</span> 'somekey
                 <span class="org-builtin">:update-set</span> 'some-val (<span class="org-builtin">:+</span> 'test.some-val 1)))
</pre>
</div>
<p>
With select clause which returns a single row
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query (<span class="org-builtin">:insert-rows-into</span> 'attendence <span class="org-builtin">:columns</span> 'event-id 'client-id 'attend-status
        <span class="org-builtin">:values</span> '(((<span class="org-builtin">:select</span> 'id
                    <span class="org-builtin">:from</span> 'event
                    <span class="org-builtin">:where</span> (<span class="org-builtin">:=</span> (<span class="org-builtin">:lower</span> 'event-dt) <span class="org-string">"2020-01-11 17:00:00"</span>))
                   3
                   <span class="org-string">"No Show"</span>))
        <span class="org-builtin">:on-conflict-on-constraint</span> 'attendance-pkey
        <span class="org-builtin">:update-set</span> 'attend-status 'excluded.attend_status))
</pre>
</div>
</div>
</div>

<div id="outline-container-insert-from-alist" class="outline-3">
<h3 id="insert-from-alist">Inserting from an alist</h3>
<div class="outline-text-3" id="text-insert-from-alist">
<p>
Assume that you have a list of alists and you want to insert the data. If the list of alists contain all the columns, then you do not need to specify the columns and simply loop across to get the total lists of values:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((alst '(((name . <span class="org-string">"John"</span>) (age . 34)) ((name . <span class="org-string">"Susan"</span>) (age . 37)))))
  (query (<span class="org-builtin">:insert-rows-into</span> 'table
          <span class="org-builtin">:values</span> (<span class="org-keyword">loop</span> <span class="org-builtin">:for</span> x <span class="org-builtin">:in</span> alst
                        <span class="org-builtin">:collect</span>
                        (<span class="org-keyword">loop</span> <span class="org-builtin">:for</span> y <span class="org-builtin">:in</span> x
                              <span class="org-builtin">:collect</span> (cdr y))))))
</pre>
</div>
<p>
If the alists only contain a subset of the columns, then you would need to specify the columns:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">let</span> ((alst '(((name . <span class="org-string">"John"</span>) (age . 34)) ((name . <span class="org-string">"Susan"</span>) (age . 37)))))
  (query (<span class="org-builtin">:insert-rows-into</span> 'table
          <span class="org-builtin">:columns</span> 'name 'age
          <span class="org-builtin">:values</span> (<span class="org-keyword">loop</span> <span class="org-builtin">:for</span> x <span class="org-builtin">:in</span> alst
                        <span class="org-builtin">:collect</span>
                        (<span class="org-keyword">loop</span> <span class="org-builtin">:for</span> y <span class="org-builtin">:in</span> x
                              <span class="org-builtin">:collect</span> (cdr y))))))
</pre>
</div>
</div>
</div>
