doc/s-sql-i.org
** Inserting from a plist
  :PROPERTIES:
  :CUSTOM_ID: insert-from-plist
  :END:
What happens if you want to insert from a plist?

Assume you have a plist where the keys are interned that you want to insert as a record. Consider the following:
#+begin_src lisp
  (query
   (sql-compile
    (append `(:insert-into ,table :set)
            plst)))
#+end_src

That gives you the opportunity to generalize into something like this:
#+begin_src lisp
(defun insert-db-from-plist (table plst)
  "Takes a table and a plist and inserts the plist into the table as a new record."
  (when (stringp table)
    (setf table (intern (string-upcase table))))
     (with-connection (db)
                      (query
                       (sql-compile
                        (append `(:insert-into ,table :set)
                                  (loop for x in plst counting x into y collect
                                        (if (oddp y)
                                            (cond ((symbolp x)
                                                   x)
                                                  ((stringp x)
                                                   (intern (string-upcase x)))
                                                  (t nil))
                                          x)))))))
#+end_src

* Intersect
  :PROPERTIES:
  :CUSTOM_ID: intersect
  :END:
Intersect produces a result that contain rows that appear on all the sub-selects.
#+begin_src lisp
  (query (:intersect (:select 'countries.name
                            :from 'countries
                            :where (:< 'latitude 16.44))
                   (:select 'countries.name
                            :from 'countries 'regions
                            :where (:and (:= 'region-id 'regions.id)
                                         (:= 'regions.name "Caribbean")))))

(("Aruba") ("Netherlands Antilles") ("Grenada") ("Barbados") ("Trinidad and Tobago"))
#+end_src

* Intervals
  :PROPERTIES:
  :CUSTOM_ID: intervals
  :END:
See  [[file:interval-notes.html][Interval Notes]]
