doc/s-sql-i.html
<div id="outline-container-insert-from-plist" class="outline-3">
<h3 id="insert-from-plist">Inserting from a plist</h3>
<div class="outline-text-3" id="text-insert-from-plist">
<p>
What happens if you want to insert from a plist?
</p>

<p>
Assume you have a plist where the keys are interned that you want to insert as a record. Consider the following:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(query
 (sql-compile
  (append `(<span class="org-builtin">:insert-into</span> ,table <span class="org-builtin">:set</span>)
          plst)))
</pre>
</div>

<p>
That gives you the opportunity to generalize into something like this:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">insert-db-from-plist</span> (table plst)
  <span class="org-doc">"Takes a table and a plist and inserts the plist into the table as a new record."</span>
  (<span class="org-keyword">when</span> (stringp table)
    (setf table (intern (string-upcase table))))
     (<span class="org-keyword">with-connection</span> (db)
                      (query
                       (sql-compile
                        (append `(<span class="org-builtin">:insert-into</span> ,table <span class="org-builtin">:set</span>)
                                  (<span class="org-keyword">loop</span> for x in plst counting x into y collect
                                        (<span class="org-keyword">if</span> (oddp y)
                                            (<span class="org-keyword">cond</span> ((symbolp x)
                                                   x)
                                                  ((stringp x)
                                                   (intern (string-upcase x)))
                                                  (t nil))
                                          x)))))))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-intersect" class="outline-2">
<h2 id="intersect">Intersect</h2>
<div class="outline-text-2" id="text-intersect">
<p>
Intersect produces a result that contain rows that appear on all the sub-selects.
</p>
<div class="org-src-container">
<pre class="src src-lisp">  (query (<span class="org-builtin">:intersect</span> (<span class="org-builtin">:select</span> 'countries.name
                            <span class="org-builtin">:from</span> 'countries
                            <span class="org-builtin">:where</span> (<span class="org-builtin">:&lt;</span> 'latitude 16.44))
                   (<span class="org-builtin">:select</span> 'countries.name
                            <span class="org-builtin">:from</span> 'countries 'regions
                            <span class="org-builtin">:where</span> (<span class="org-builtin">:and</span> (<span class="org-builtin">:=</span> 'region-id 'regions.id)
                                         (<span class="org-builtin">:=</span> 'regions.name <span class="org-string">"Caribbean"</span>)))))

((<span class="org-string">"Aruba"</span>) (<span class="org-string">"Netherlands Antilles"</span>) (<span class="org-string">"Grenada"</span>) (<span class="org-string">"Barbados"</span>) (<span class="org-string">"Trinidad and Tobago"</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-intervals" class="outline-2">
<h2 id="intervals">Intervals</h2>
<div class="outline-text-2" id="text-intervals">
<p>
See  <a href="interval-notes.html">Interval Notes</a>
</p>
</div>
</div>
</div>
</body>
</html>